# This notebook will demonstrate all the features I developed for the project.

In [1]:
import project.tools.db_utils as dbu

## Get metadata from the database using SQLAlchemy

In [8]:
for table_name in dbu.get_table_names():
    print(f'Table: {table_name}')
    
for view_names in dbu.get_view_names():
    print(f'View: {view_names}')
    
    
table_name = dbu.get_table_names()[0]
for column in dbu.get_columns(table_name):
    print(f"Column ({table_name}): {column['name']:<15} Type: {column['type']}")

Table: group_members
Table: members_to_artists
Table: record_albums
Table: record_artists
Table: record_genres
Table: record_labels
Table: record_sales
Table: record_tracks
View: album_information
View: album_information_details
View: band_members
Column (group_members): member_id       Type: INTEGER
Column (group_members): member_name     Type: VARCHAR(255)

## Get all the connecting information

In [10]:
display(dbu.sqlalchemy_query_to_df('select * from record_albums', 'album_id'))
display(dbu.sqlalchemy_query_to_df('select * from record_artists', 'artist_id'))
display(dbu.sqlalchemy_query_to_df('select * from group_members', 'member_id'))
display(dbu.sqlalchemy_query_to_df('select * from members_to_artists', 'members_to_artists_id'))
display(dbu.sqlalchemy_query_to_df('select * from record_genres', 'genre_id'))
display(dbu.sqlalchemy_query_to_df('select * from record_labels', 'record_label_id'))
display(dbu.sqlalchemy_query_to_df('select * from record_tracks', 'track_id'))
display(dbu.sqlalchemy_query_to_df('select * from record_sales', 'sale_id'))

,name,release_date,artist_id,genre_id,record_label_id
album_id,,,,,
1,The Dark Side of the Moon,1973-03-01,1,1,1
2,Boston,1976-08-25,2,1,2

          artist_name
artist_id
1          Pink Floyd
2              Boston

              member_name
member_id
1             Syd Barrett
2            Roger Waters
3          Richard Wright
4              Nick Mason
5           David Gilmour
6              Tom Scholz
7               Brad Delp
8          Barry Goudreau
9            Fran Sheehan
10            Sib Hashian

                       member_id  artist_id member_from_date member_to_date
members_to_artists_id
1                              1          1       1965-01-01     1968-01-01
2                              2          1       1965-01-01     1985-01-01
3                              3          1       1965-01-01     1980-01-01
4                              4          1       1965-01-01     1995-01-01
5                              5          1       1968-01-01     1995-01-01
6                              6          2       1975-01-01     1989-01-01
7                              7          2       1975-01-01     2007-01-01
8                              8          2       1975-01-01     1981-01-01
9                              9          2       1975-01-01     1986-01-01
10                            10          2       1975-01-01     1986-01-01

         genre_name genre_description
genre_id
1              Rock        Rock music

                       record_label_name
record_label_id
1                Harvest Capitol Records
2                           Epic Records

          album_id                    track_name  track_number  genre_id
track_id
1                1                   Speak to Me             1         1
2                1          Breathe (In the Air)             2         1
3                1                    On the Run             3         1
4                1                          Time             4         1
5                1      The Great Gig in the Sky             5         1
6                1                         Money             6         1
7                1                   Us and Them             7         1
8                1           Any Colour You Like             8         1
9                1                  Brain Damage             9         1
10               1                       Eclipse            10         1
11               2           More Than a Feeling             1         1
12               2                 Peace of Mind             2         1
13               2            Foreplay/Long Time             3         1
14               2              Rock & Roll Band             4         1
15               2                        Smokin             5         1
16               2                  Hitch a Ride             6         1
17               2           Something About You             7         1
18               2  Let Me Take You Home Tonight             8         1

         album_id   sale_date  sale_quantity  unit_sale_price
sale_id
1               1  1973-01-01        1000000             10.0
2               1  1974-01-01        1000000             10.0
3               1  1975-01-01        1000000             10.0
4               1  1976-01-01        1000000             10.0
5               1  1977-01-01        1000000             10.0
6               1  1978-01-01        1000000             10.0
7               1  1979-01-01        1000000             10.0
8               1  1980-01-01        1000000             10.0
9               1  1981-01-01        1000000             10.0
10              1  1982-01-01        1000000             10.0
11              1  1983-01-01        1000000             10.0
12              1  1984-01-01        1000000             10.0
13              1  1985-01-01        1000000             10.0
14              1  1986-01-01        1000000             10.0
15              1  1987-01-01        1000000             10.0
16              2  1976-01-01        1000000             10.0
17              2  1977-01-01        1000000             10.0
18              2  1978-01-01        1000000             10.0
19              2  1979-01-01        1000000             10.0
20              2  1980-01-01        1000000             10.0
21              2  1981-01-01        1000000             10.0
22              2  1982-01-01        1000000             10.0
23              2  1983-01-01        1000000             10.0
24              2  1984-01-01        1000000             10.0
25              2  1985-01-01        1000000             10.0
26              2  1986-01-01        1000000             10.0
27              2  1987-01-01        1000000             10.0

## Read all the album information from the database view album_information into a dataframe

In [5]:
query = 'select * from album_information'
albums_df = dbu.sqlalchemy_query_to_df(query, ['name', 'release_date', 'artist_name'])
display(albums_df)

,,,genre_name,record_label_name
name,release_date,artist_name,,
The Dark Side of the Moon,1973-03-01,Pink Floyd,Rock,Harvest Capitol Records
Boston,1976-08-25,Boston,Rock,Epic Records

## Read all the album detail information from the database view album_information details into a dataframe

In [4]:
query = 'select * from album_information_details'
albums_df = dbu.sqlalchemy_query_to_df(query, ['name', 'release_date', 'artist_name', 'record_label_name', 'track_number'])
display(albums_df)

                                                                                        genre_name  \
name                      release_date artist_name record_label_name       track_number
Boston                    1976-08-25   Boston      Epic Records            1                  Rock
                                                                           2                  Rock
                                                                           3                  Rock
                                                                           4                  Rock
                                                                           5                  Rock
                                                                           6                  Rock
                                                                           7                  Rock
                                                                           8                  Rock
The Dark Side of the Moon 1973-03-01   Pink Floyd  Harvest Capitol Records 1                  Rock
                                                                           2                  Rock
                                                                           3                  Rock
                                                                           4                  Rock
                                                                           5                  Rock
                                                                           6                  Rock
                                                                           7                  Rock
                                                                           8                  Rock
                                                                           9                  Rock
                                                                           10                 Rock

                                                                                                           track_name
name                      release_date artist_name record_label_name       track_number
Boston                    1976-08-25   Boston      Epic Records            1                      More Than a Feeling
                                                                           2                            Peace of Mind
                                                                           3                       Foreplay/Long Time
                                                                           4                         Rock & Roll Band
                                                                           5                                   Smokin
                                                                           6                             Hitch a Ride
                                                                           7                      Something About You
                                                                           8             Let Me Take You Home Tonight
The Dark Side of the Moon 1973-03-01   Pink Floyd  Harvest Capitol Records 1                              Speak to Me
                                                                           2                     Breathe (In the Air)
                                                                           3                               On the Run
                                                                           4                                     Time
                                                                           5                 The Great Gig in the Sky
                                                                           6                                    Money
                                                                           7                              Us and Them
                                                                           8                      Any Colour You Like
                                                                           9                             Brain Damage
                                                                           10                                 Eclipse

## Show which members are in which bands

In [3]:
query = 'select * from band_members'
albums_df = dbu.sqlalchemy_query_to_df(query, 'artist_name')
display(albums_df)

                member_name member_from_date member_to_date
artist_name
Pink Floyd      Syd Barrett       1965-01-01     1968-01-01
Pink Floyd     Roger Waters       1965-01-01     1985-01-01
Pink Floyd   Richard Wright       1965-01-01     1980-01-01
Pink Floyd       Nick Mason       1965-01-01     1995-01-01
Pink Floyd    David Gilmour       1968-01-01     1995-01-01
Boston           Tom Scholz       1975-01-01     1989-01-01
Boston            Brad Delp       1975-01-01     2007-01-01
Boston       Barry Goudreau       1975-01-01     1981-01-01
Boston         Fran Sheehan       1975-01-01     1986-01-01
Boston          Sib Hashian       1975-01-01     1986-01-01

## Read record_labels from the database using the business object

In [8]:
from project.business_objects import record_label_bo as rl_bo
record_label_row = rl_bo.read_record_label(1)
print(record_label_row)

ProgrammingError: 1146 (42S02): Table 'album_information.record_label' doesn't exist